gotohome/xml/HotelAvailRQ_IHG.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<Header>
		<authentication xmlns="Production">
			<userid>9091</userid>
			<password>traVL87sky</password>
		</authentication>
	</Header>
	<Body>
		<OTA_HotelAvailRQ Version="1.003" xmlns="http://www.opentravel.org/OTA/2003/05" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.opentravel.org/OTA/2003/05 OTA_HotelAvailRQ.xsd">
			<POS>
				<Source>
					<RequestorID ID="99621675" Type="0" URL="http://www.travelsky.com">
						<CompanyName CompanyShortName="travelsky">travelsky</CompanyName>
					</RequestorID>
				</Source>
			</POS>
			<AvailRequestSegments>
				<AvailRequestSegment AvailReqType="Room">
					<StayDateRange End="2012-02-17" Start="2012-02-15"/>
					<RoomStayCandidates>
						<RoomStayCandidate Quantity="1">
							<GuestCounts IsPerRoom="false">
								<GuestCount AgeQualifyingCode="8" Count="1"/>
								<GuestCount AgeQualifyingCode="10" Count="1"/>
							</GuestCounts>
						</RoomStayCandidate>
					</RoomStayCandidates>
					<HotelSearchCriteria>
						<Criterion>
							<HotelRef HotelCode="SHNNS"/>
						</Criterion>
					</HotelSearchCriteria>
				</AvailRequestSegment>
			</AvailRequestSegments>
		</OTA_HotelAvailRQ>
	</Body>
</Envelope>
